In [1]:
import pandas as pd

In [2]:
# 2 main data types in pandas
series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
# series = 1-dimensional

In [5]:
colours = pd.Series(["Red", "Blue", "White"])

In [6]:
#dataframe = 2-dimensional

In [7]:
sample_dataframe = pd.DataFrame({"Car Make": series, "Colour": colours})

In [8]:
sales_data = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/car-sales-extended.csv")
sales_data

       Make Colour  Odometer (KM)  Doors  Price
0     Honda  White          35431      4  15323
1       BMW   Blue         192714      5  19943
2     Honda  White          84714      4  28343
3    Toyota  White         154365      4  13434
4    Nissan   Blue         181577      3  14043
..      ...    ...            ...    ...    ...
995  Toyota  Black          35820      4  32042
996  Nissan  White         155144      3   5716
997  Nissan   Blue          66604      4  31570
998   Honda  White         215883      4   4001
999  Toyota   Blue         248360      4  12732

[1000 rows x 5 columns]

In [9]:
# exporting a dataframe
sales_data.to_csv("exported_car_sales.csv", index=False)

## DESCRIBE DATA

In [10]:
sales_data.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price             int64
dtype: object

In [11]:
columns = sales_data.columns
columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [13]:
sales_data.index

RangeIndex(start=0, stop=1000, step=1)

In [15]:
sales_data.describe()

       Odometer (KM)        Doors         Price
count    1000.000000  1000.000000   1000.000000
mean   131073.708000     4.014000  16045.665000
std     68859.723885     0.379405   8630.794219
min     10148.000000     3.000000   2796.000000
25%     71238.000000     4.000000   9481.500000
50%    131202.000000     4.000000  14264.000000
75%    192372.750000     4.000000  20738.750000
max    249860.000000     5.000000  52458.000000

In [16]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           1000 non-null   object
 1   Colour         1000 non-null   object
 2   Odometer (KM)  1000 non-null   int64
 3   Doors          1000 non-null   int64
 4   Price          1000 non-null   int64
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [18]:
sales_data.mean()

Odometer (KM)    131073.708
Doors                 4.014
Price             16045.665
dtype: float64

In [19]:
car_prices = pd.Series([1500, 3000, 9000, 25000])
car_prices.mean()

9625.0

In [20]:
sales_data.sum()

Make             HondaBMWHondaToyotaNissanHondaToyotaHondaNissa...
Colour           WhiteBlueWhiteWhiteBlueRedBlueWhiteWhiteBlueWh...
Odometer (KM)                                            131073708
Doors                                                         4014
Price                                                     16045665
dtype: object

In [21]:
sales_data["Price"].sum()

NameError: name 'car_sales' is not defined